src/Catalogs/ШтатноеРасписание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ШтатноеРасписание</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолжностейППС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кафедра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кафедры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПКГ</Name>
					<Comment>Номер профессиональной квалификационной группы сотрудника в соответствии с приказом Министерства Здравоохранения РФ</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УровеньПГК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляСтавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностнаяИнструкция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШтатноеРасписание/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции      
&НаСервере
Процедура ОбновитьНаименованиеОбъектаНаСервере(ЕстьКафедра = Истина)
	Объект.Наименование = Объект.ТипДолжности.Наименование;
	Если ЕстьКафедра Тогда
		Объект.Наименование = Объект.Наименование + " каф. "
							+ Объект.Кафедра.Наименование;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Кафедра.Пустая() Тогда
		ОбновитьНаименованиеОбъектаНаСервере(Ложь);
	Иначе
		ОбновитьНаименованиеОбъектаНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтандартнымТекстом(Команда)
	Если Не Объект.ДолжностнаяИнструкция = "" Тогда
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
		ПоказатьВопрос(Оповещение ,"Вы действительно хотите перезаписать "
					  + "поле должностной инструкции стандартным "
					  + "значением?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, 
					    "Заполнение", ); 	
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСтандартнымТекстомНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтандартнымТекстомНаСервере()
	Объект.ДолжностнаяИнструкция = Константы.ТекстДолжностнаяИнструкция.Получить(); 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(РезультатВопроса, ДополнительныйПараметр) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСтандартнымТекстомНаСервере();
КонецПроцедуры;
#КонецОбласти
